name: "neural-cf"
platform: "onnxruntime_onnx"
max_batch_size: 256

input [
  {
    name: "user_ids"
    data_type: TYPE_INT64
    dims: [ 1 ]
  },
  {
    name: "item_ids"
    data_type: TYPE_INT64
    dims: [ 1 ]
  }
]

output [
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]

dynamic_batching {
  preferred_batch_size: [ 32, 64, 128 ]
  max_queue_delay_microseconds: 100
}
